sdaiIsSDAIKindOf(Sdai_instS*,Sdai_instS*)
\details
Determines whether a specified SDAI data type is a kind of a specified type.
\param instance [in] An application instance that represents the SDAI data type to be checked.
\param entity   [in] An entity that represents the type.
\returns sdaiTRUE if the specified SDAI data type is a kind of the specified type; otherwise, the function returns false.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiED_NDEF - Entity definition not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.